cisneosemeczki/my_projects_1/robot delta/projekt stm32/delta_fw/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BUTTON_Pin GPIO_PIN_13
#define USER_BUTTON_GPIO_Port GPIOC
#define USER_BUTTON_EXTI_IRQn EXTI15_10_IRQn
#define Z_MIN_Pin GPIO_PIN_2
#define Z_MIN_GPIO_Port GPIOC
#define Z_MIN_EXTI_IRQn EXTI2_IRQn
#define Z_MAX_Pin GPIO_PIN_3
#define Z_MAX_GPIO_Port GPIOC
#define Z_MAX_EXTI_IRQn EXTI3_IRQn
#define Y_STEP_Pin GPIO_PIN_0
#define Y_STEP_GPIO_Port GPIOA
#define Y_DIR_Pin GPIO_PIN_1
#define Y_DIR_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define X_STEP_Pin GPIO_PIN_6
#define X_STEP_GPIO_Port GPIOA
#define X_DIR_Pin GPIO_PIN_10
#define X_DIR_GPIO_Port GPIOB
#define X_STEPC7_Pin GPIO_PIN_7
#define X_STEPC7_GPIO_Port GPIOC
#define Z_DIR_Pin GPIO_PIN_8
#define Z_DIR_GPIO_Port GPIOA
#define Y_MIN_Pin GPIO_PIN_15
#define Y_MIN_GPIO_Port GPIOA
#define Y_MIN_EXTI_IRQn EXTI15_10_IRQn
#define X_MIN_Pin GPIO_PIN_10
#define X_MIN_GPIO_Port GPIOC
#define X_MIN_EXTI_IRQn EXTI15_10_IRQn
#define X_MAX_Pin GPIO_PIN_12
#define X_MAX_GPIO_Port GPIOC
#define X_MAX_EXTI_IRQn EXTI15_10_IRQn
#define Z_EN_Pin GPIO_PIN_3
#define Z_EN_GPIO_Port GPIOB
#define X_EN_Pin GPIO_PIN_5
#define X_EN_GPIO_Port GPIOB
#define Z_STEP_Pin GPIO_PIN_6
#define Z_STEP_GPIO_Port GPIOB
#define Y_MAX_Pin GPIO_PIN_7
#define Y_MAX_GPIO_Port GPIOB
#define Y_MAX_EXTI_IRQn EXTI9_5_IRQn
#define Y_EN_Pin GPIO_PIN_8
#define Y_EN_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
